[
  {
    "id": "e4ba391bff66e3a250ca96223630ea7e",
    "date": "January 2, 2020",
    "data": "Important NoticeThe Ontario Immigrant Nominee Program has reached its increased 2019 nomination allocation and has started to notify successful applicants. The OINP has issued a total of 7350 nominations to successful applicants across all streams in 2019, including the 700 additional nominations received through an in-year reallocation. An additional 41 nominations were issued for temporary foreign workers in intermediate skilled occupations (National Occupation Classification (NOC) – Skill Level C) through the federal government’s NOC C initiative.New applications, and applications which have already been submitted to the OINP, will continue to be accepted and considered under the OINP’s 2020 nomination allocation.You can check the status of your application at any time through the OINP e-Filing Portal.Please monitor this OINP Updates page for news, announcements and program developments."
  },
  {
    "id": "ed2d88ccc1016bc40cf2d077c665bee2",
    "date": "January 9, 2020",
    "data": "Important NoticeIssuance of Notifications of Interest under Ontario’s Express Entry French-Speaking Skilled Worker streamOn January 9, 2020 the Ontario Immigrant Nominee Program (OINP) issued Notifications of Interest (NOIs) to candidates who may qualify for Ontario’s Express Entry French-Speaking Skilled Worker stream.To manage demand, NOIs were issued to candidates who had a Comprehensive Ranking Score (CRS) between 433 and 472.If you received a NOI, you do not need to contact the program. Please visit the French-Speaking Skilled Worker stream webpage for information about program criteria and how to apply."
  },
  {
    "id": "f880c46d0cf96e9901ec424bff3c40c7",
    "date": "January 15, 2020",
    "data": "Tech Draw: Issuance of Notifications of Interest under Ontario’s Express Entry Human Capital Priorities StreamOn January 15, 2020, the Ontario Immigrant Nominee Program (OINP) issued targeted Notifications of Interest (NOIs) to candidates who may qualify for Ontario’s Express Entry Human Capital Priorities (HCP) Stream. If you received a NOI, you do not need to contact the program.The OINP targeted candidates with a CRS between 460 and 472, and work experience in the following NOC codes:2173 Software engineers and designers2174 Computer programmer and interactive media developers2147 Computer engineers2175 Web designers and developers2172 Database analysts and data administrators0213 Computer and information systems managersTo be eligible for nomination, applicants must demonstrate work experience in one of the eligible NOC codes. Your application may be refused if you do not demonstrate work experience in one of the eligible NOC codes.Through this dedicated approach, we’re helping to make it easier for businesses in the technology sector to recruit top talent from around the world.To ensure that this initiative meets the needs of Ontario employers, we engaged with stakeholders across the province through a survey and face-to-face consultations. This helped us choose priority occupations for the targeted technology occupations draws.For more information on this initiative, please visit the OINP Tech Draw page."
  },
  {
    "id": "1c6cc55d31a141b6459c9909c9d886f9",
    "date": "January 16, 2020",
    "data": "Important Notice - Proposed Regulatory AmendmentsIn an effort to be more responsive to regional labour market and employer needs, remove administrative barriers and support employer access to the program across Ontario, the Ministry of Economic Development, Job Creation and Trade is proposing amendments to:Ontario Regulation 422/17 (General)The amendments are now posted on Ontario’s Regulatory Registry for public consultation for a period of 45 calendar days.Proposed Amendments to Ontario Regulation 422/17 (General) a Minister’s Regulation made under the Ontario Immigration Act, 2015We encourage you to provide feedback on these proposed changes during the consultation period which will end on March 2nd, 2020."
  },
  {
    "id": "335d2241c40f897c9125a4c432b118ef",
    "date": "February 13, 2020",
    "data": "Issuance of Notifications of Interest by Targeted Occupations under Ontario’s Express Entry Human Capital Priorities StreamOn February 13, 2020, the Ontario Immigrant Nominee Program (OINP) issued targeted Notifications of Interest (NOI) to candidates who may qualify for Ontario’s Express Entry Human Capital Priorities (HCP) Stream. If you received a NOI, you do not need to contact the program.The OINP targeted candidates with a Comprehensive Randing System (CRS) between 467 and 471, and work experience in the following National Occupational Classification (NOC) codes:0111   Financial managers0114   Other administrative services managers0124   Advertising, marketing and public relations managers0601   Corporate sales managers0621   Retail and wholesale trade managers0651   Managers in customer and personal services, n.e.c.1111   Financial auditors and accountants1114   Other financial officers1122   Professional occupations in business management consulting3012   Registered nurses and registered psychiatric nursesTo be eligible for nomination, applicants must demonstrate work experience in one of the eligible NOC codes. Your application may be refused if you do not demonstrate work experience in one of the eligible NOC codes.Through this dedicated approach, we’re helping to make it easier for businesses to recruit top talent from around the world.To ensure that this initiative meets the needs of Ontario employers, we engaged with stakeholders across the province through a survey and face-to-face consultations. This helped us choose priority occupations for the targeted draw."
  },
  {
    "id": "8d7dd2ef4e4520f4e4039081d411c571",
    "date": "February 26, 2020",
    "data": "Entrepreneur Stream – Invitations to Apply IssuedOn February 26, 2020 the Ontario Immigrant Nominee Program (OINP) issued 20 Invitations to Apply (ITAs) under the Entrepreneur Stream (OINP:ES). Expressions of Interest (EOIs) received and scored by the OINP:ES between November 22, 2019 and February 14, 2020 were eligible for consideration for this ITA Round. ITAs were issued for EOIs that received a score of between 136 and 200.If you received an ITA, you do not need to contact the program. You will receive two emails containing login information and instructions for submitting an application.If you received a notice that your EOI was eligible to receive an ITA but did not receive an ITA this round, the EOI scored below 136. An EOI remains eligible to receive an ITA for 12 months from the date it was submitted to the OINP.Please visit the Ontario Immigrant Nominee Program to learn more about the Entrepreneur Stream and Expression of Interest scoring criteria."
  },
  {
    "id": "8c4ab2828a7eff3a949c3bdfcc7b46b3",
    "date": "March 3, 2020",
    "data": "OINP now accepting applications to the Employer Job Offer: International Student StreamThe Ontario Immigrant Nominee Program (OINP) is now accepting applications to the Employer Job Offer: International Student Stream.Once the intake limit has been met, the system will automatically prevent further registrations from being submitted. Should the limit be met outside regular business hours, a notice will be posted on this page the next business day.You must access the OINP e-Filing Portal directly from the Employer Job Offer: International Student stream page on the OINP website. Please click on the button ‘Submit an application’.If you experience technical difficulties while using the OINP e-Filing Portal, please contact the OINP directly at: ontarionominee@ontario.ca and include a screen shot with details about how the error occurred."
  },
  {
    "id": "c034f6ee022296ec61660226bb6a911f",
    "date": "March 3, 2020",
    "data": "Update: Employer Job Offer: International Student StreamThe Employer Job Offer: International Student Stream opening has been paused due to technical issues.The OINP is investigating the cause of the technical issues and are working to open the stream as soon as possible.Please continue to monitor this page for news, announcements and program developments."
  },
  {
    "id": "4ba41a86e413c93d9a1335c020e85a60",
    "date": "March 3, 2020",
    "data": "OINP now accepting applications to the Employer Job Offer: International Student and Foreign Worker StreamsThe Ontario Immigrant Nominee Program (OINP) is now accepting applications to both the Employer Job Offer: International Student and Foreign Worker streams.Once the intake limits have been met, the system will automatically prevent further registrations from being submitted. Should the limits be met outside regular business hours, a notice will be posted on this page the next business day.You must access the OINP e-Filing Portal directly from the Employer Job Offer: International Student or Foreign Worker stream page on the OINP website. Please click on the button ‘Submit an application’.If you experience technical difficulties while using the OINP e-Filing Portal, please contact the OINP directly at: ontarionominee@ontario.ca and include a screen shot with details about how the error occurred."
  },
  {
    "id": "80402a6974302f900236019c15998386",
    "date": "March 3, 2020",
    "data": "OINP has closed intake to the Employer Job Offer: International Student and Foreign Worker StreamsPlease note that the Employer Job Offer: International Student and Foreign Worker Streams are now closed, and no additional registrations will be accepted until further notice.The Employer Job Offer: In-Demand Skills Stream remains open to applications at this time."
  },
  {
    "id": "1679db2734df02f88cf62cb2e902404a",
    "date": "March 4, 2020",
    "data": "Update: Employer Job Offer: International Student and Foreign Worker StreamsThe OINP received 1322 successful registrations during the March 3rd opening of the Employer Job Offer: International Student and Foreign Worker streams.Individuals who successfully completed registration and received a file number have 14 days to submit an application.The OINP will continue to monitor intake of applications across all streams to determine when the Employer Job Offer: International Student and Foreign Worker streams will reopen in 2020.The Employer Job Offer: In-Demand Skills Stream remains open to applications at this time."
  },
  {
    "id": "4228ba68c55ab45fbdd0cd811b36f160",
    "date": "March 5, 2020",
    "data": "Please be advised that the Ontario Immigrant Nominee Program (OINP) continues to experience a high volume of users in the e-Filing system. You may experience delays in accessing the e-Filing system as a result.The Employer Job Offer: International Student, Employer Job Offer: Foreign Worker and Masters Graduate streams remain closed, and the OINP will not be reopening these streams at this time. If you do not have a file number with the OINP, please logout of the e-Filing system.If you registered during the March 3rd opening of the Employer Job Offer: International Student and Foreign Worker streams, please remember that you have 14 days to submit an application. You may wish to access the system during off-peak hours (7pm – 7am EST).Any client with a deadline to submit an application or upload documents that is currently affected by high system volume is asked to contact the program directly at ontarionominee@ontario.ca. Please include your file number in all correspondence with the OINP."
  },
  {
    "id": "6b70f5dd119b8f5eda41fa342eaae02d",
    "date": "March 6, 2020",
    "data": "Please be advised that the Ontario Immigrant Nominee Program (OINP) continues to experience a high volume of users in the e-Filing system. You may experience delays in accessing the e-Filing system as a result. If you do not have a file number with the OINP, please logout of the e-Filing system.As noted in yesterday’s program update, the Employer Job Offer: International Student, Employer Job Offer: Foreign Worker and Masters Graduate streams remain closed, and the OINP will not be reopening these streams at this time. The OINP will continue to monitor intake of applications across all streams to determine when to reopen in 2020.If you registered during the March 3rd opening of the Employer Job Offer: International Student and Foreign Worker streams, the deadline to submit an application has been extended to March 24, 2020.Any existing client with a deadline to submit an application or upload documents that is currently affected by high system volume is asked to contact the program directly at ontarionominee@ontario.ca. Please include your file number in all correspondence with the OINP."
  },
  {
    "id": "e99ca36ce6559ad426b5d88e4d1e5d74",
    "date": "March 6, 2020",
    "data": "Please be advised that the Ontario Immigrant Nominee Program (OINP) e-Filing system is undergoing system maintenance until further notice. You may be unable to access the e-Filing system during this time. A notice will be posted when the e-Filing system is accessible to users. We appreciate your patience."
  },
  {
    "id": "d087563a11abc49aa1318d6bcb16f766",
    "date": "March 6, 2020",
    "data": "Please be advised that the Ontario Immigrant Nominee Program (OINP) e-Filing system maintenance is complete. Users can continue to access the e-Filing system."
  }
]